* 1.1
#+BEGIN_SRC shell :results output
ls -ldi ./ ../
ls -ldi /. /..
#+END_SRC

#+RESULTS:
: 10625423 drwxr-xr-x 4 abcdlsj abcdlsj 4096  3月 10 15:36 ../
: 14161853 drwxr-xr-x 2 abcdlsj abcdlsj 4096  3月 10 15:59 ./
: 2 drwxr-xr-x 17 root root 4096  2月  6 16:31 /.
: 2 drwxr-xr-x 17 root root 4096  2月  6 16:31 /..

* 1.2
Unix 系统内核对新创建进程顺序分配 PID，程序运行期间，系统创建了两个新的进程
* 1.3
#+BEGIN_SRC cpp
#include <string.h>
// 传递的是 int 型，实参赋值到形参当中，对实参没有影响
char *strerror(int errnum);

#include <stdio.h>
// 传递的是指针类型，需要使用 const 限定不能通过此指针修改字符串
void perror(const char *msg);
#+END_SRC
* 1.4
32 有符号整数，有效位为 31 位，也就是 2^31 秒，68 年
* 1.5
248.551348

